# Brewfile — installed/updated by `brew bundle --file=./Brewfile`
# Comment out anything you don't want; this is a starting point.

# ============================================================
# Taps
# ============================================================
# Note: homebrew/bundle and homebrew/services were deprecated in 2025.
# Both `brew bundle` and `brew services` are now built into Homebrew core,
# so no taps are needed here. Add any third-party taps below as needed.

# ============================================================
# CLI essentials
# ============================================================
brew "git"
brew "gh"                 # GitHub CLI
brew "zsh"                # newer Zsh than macOS ships with
brew "coreutils"          # GNU versions of common Unix tools
brew "findutils"
brew "grep"
brew "wget"
brew "curl"
brew "tree"
brew "jq"                 # JSON processor
brew "ripgrep"            # fast grep replacement (`rg`)
brew "fd"                 # fast `find` replacement
brew "bat"                # `cat` with syntax highlighting
brew "eza"                # modern `ls`
brew "fzf"                # fuzzy finder
brew "tldr"               # simplified man pages
brew "htop"
brew "mas"                # Mac App Store CLI

# ============================================================
# Git helpers
# ============================================================
brew "gitleaks"

# ============================================================
# Zsh enhancements
# ============================================================
brew "pure"               # minimalist zsh prompt (loaded in shell/zshrc)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ============================================================
# GUI apps (casks)
# ============================================================
cask "iterm2"
cask "visual-studio-code"
cask "cursor"
cask "google-chrome"
cask "rectangle"          # window management
cask "raycast"            # spotlight replacement
cask "1password-cli"

# Fonts (handy if you ever want a Powerline / Nerd Font for Zsh themes)
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"

# ============================================================
# Mac App Store apps (uncomment & add IDs as needed)
# Find IDs with: mas search "App Name"
# ============================================================
# mas "Magnet", id: 441258766
# mas "Things", id: 904280696
