# Brewfile — installed/updated by `brew bundle --file=./Brewfile`
# Comment out anything you don't want; this is a starting point.

# ============================================================
# Taps
# ============================================================
# Note: homebrew/bundle and homebrew/services were deprecated in 2025.
# Both `brew bundle` and `brew services` are now built into Homebrew core,
# so no taps are needed here. Add any third-party taps below as needed.

# ============================================================
# CLI essentials
# ============================================================
brew "git"                # version control system
brew "gh"                 # GitHub CLI
brew "zsh"                # newer Zsh than macOS ships with
brew "coreutils"          # GNU versions of common Unix tools
brew "findutils"          # GNU `find`, `locate`, `updatedb`, and `xargs`
brew "grep"               # GNU `grep`
brew "wget"               # network downloader (alternative to `curl`)
brew "curl"               # network downloader (comes with macOS, but can be updated separately)
brew "tree"               # directory listing with tree structure
brew "jq"                 # JSON processor
brew "ripgrep"            # fast grep replacement (`rg`)
brew "fd"                 # fast `find` replacement
brew "bat"                # `cat` with syntax highlighting
brew "eza"                # modern `ls`
brew "fzf"                # fuzzy finder
brew "tldr"               # simplified man pages
brew "htop"               # interactive process viewer
brew "mas"                # Mac App Store CLI

# brew "cmake"              # build system (needed for some Python packages)
# brew "pyenv"              # manage multiple Python versions
# brew "go"                 # Go programming language
# brew "rustup-init"        # Rust toolchain installer

# brew "deno"               # JavaScript/TypeScript runtime (alternative to Node.js)
# brew "libxcrypt"          # required by some Node.js packages
# brew "llvm"               # required by some Node.js packages
brew "moreutils"          # collection of useful CLI tools (includes `sponge`)
brew "pkg-config"         # helper for compiling software (required by some Node.js packages)
brew "pure"               # minimalist zsh prompt (also loaded in shell/zshrc)

# ============================================================
# Web development tools
# ============================================================

brew "node"               # Node.js (for JavaScript development)
brew "npm"                # Node.js package manager (comes with Node.js, but can be updated separately)
brew "nvm"                # Node Version Manager (alternative to `node` for managing multiple Node versions)
brew "pnpm"               # JavaScript package manager (alternative to npm and yarn)
brew "yarn"               # JavaScript package manager

# ============================================================
# Git helpers
# ============================================================
brew "gitleaks"

# ============================================================
# Zsh enhancements
# ============================================================
brew "pure"               # minimalist zsh prompt (loaded in shell/zshrc)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ============================================================
# GUI apps (casks)
# ============================================================
cask "iterm2"              # terminal emulator
cask "visual-studio-code"  # code editor
cask "cursor"              # code editor
cask "google-chrome"       # web browser
cask "rectangle"           # window management
cask "raycast"             # spotlight replacement
cask "1password"            # password manager (desktop app)
cask "1password-cli"        # password manager CLI (also has a desktop app, but I prefer the CLI)
# cask "notion"              # note-taking and productivity app

# Fonts (handy if you ever want a Powerline / Nerd Font for Zsh themes)
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
# cask "font-jetbrains-mono"  # great for coding, but not a Nerd Font (no Powerline symbols)
# cask "font-roboto-mono"    # great for coding, but not a Nerd Font (no Powerline symbols)
# cask "font-source-code-pro" # great for coding, but not a Nerd Font (no Powerline symbols)
# cask "font-ubuntu-mono"    # great for coding, but not a Nerd Font (no Powerline symbols)
# cask "font-operator-mono"   # great for coding, but not a Nerd Font (no Powerline symbols)
# cask "font-iosevka"        # great for coding, but not a Nerd Font (no Powerline symbols)
# cask "font-jetbrains-mono-nerd-font" # JetBrains Mono patched with Nerd Font symbols
# cask "font-roboto-mono-nerd-font"   # Roboto Mono patched with Nerd Font symbols
# cask "font-source-code-pro-nerd-font" # Source Code Pro patched with Nerd
# cask "font-ubuntu-mono-nerd-font"   # Ubuntu Mono patched with Nerd Font symbols
# cask "font-operator-mono-nerd-font" # Operator Mono patched with Nerd Font symbols
# cask "font-iosevka-nerd-font"      # Iosevka patched with Nerd Font symbols


# ============================================================
# Mac App Store apps (uncomment & add IDs as needed)
# Find IDs with: mas search "App Name"
# ============================================================
# mas "Magnet", id: 441258766
# mas "Things", id: 904280696
# mas "Notion", id: 1232780281
# mas "1Password for Safari", id: 1569813296
# mas "HP", id: 1474276998
# mas "Xcode", id: 497799835
