# VS Code extensions to install on a fresh machine.
# One extension per line, in publisher.name format.
# Regenerate this list anytime with:
#   code --list-extensions > vscode/extensions.txt
#
# Install all of them with:
#   xargs -L1 code --install-extension < vscode/extensions.txt

editorconfig.editorconfig
esbenp.prettier-vscode
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
openai.chatgpt
streetsidesoftware.code-spell-checker
yzhang.markdown-all-in-one
github.copilot-chat
